# Exploración y analisas de los datos

### Librerias empleadas

In [23]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [24]:
import os

os.listdrives()

['C:\\']

#### Carga de los datos

In [25]:
titanic_data = pd.read_csv('../data/Titanic-Dataset.csv')
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

La base de datos contiene 891 registris y cuenta con 12 columnas en total:

| Variable     | Definition                    | Key |
|--------------|-------------------------------|-----|
| **PassengerId**  | Identificador del pasajero     | Número único asignado a cada pasajero |
| **Survived**     | Supervivencia                  | 0 = No, 1 = Sí |
| **Pclass**       | Clase del ticket               | 1 = Primera, 2 = Segunda, 3 = Tercera |
| **Name**         | Nombre del pasajero            | Incluye título (Sr., Sra., etc.) |
| **Sex**          | Sexo                           | male = Hombre, female = Mujer |
| **Age**          | Edad en años                   | Dato númerico que mide la edad del pasajero |
| **SibSp**        | Hermanos / cónyuge a bordo     | Número de hermanos y/o cónyuge que viajaban |
| **Parch**        | Padres / hijos a bordo         | Número de padres y/o hijos que viajaban |
| **Ticket**       | Número de ticket               | Puede repetirse entre pasajeros |
| **Fare**         | Tarifa del pasajero            | Precio pagado por el boleto |
| **Cabin**        | Número de cabina               | Contiene el identificador de la cabina asignada |
| **Embarked**     | Puerto de embarque             | C = Cherbourg, Q = Queenstown, S = Southampton |

In [30]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB